export const commonNotice = [
  {
    brand: "그린스파크",
    이용가능매장: "숭실대 어디서나!",
    공급자: "그린스파크",
    이용조건: "숭멋사 부원이라면 누구나 사용 가능합니다"
  },
  {
    brand: "스타벅스",
    이용가능매장: "미군부대 매장, 워터파크 입점 매장 등 일부 매장에서는 사용이 불가합니다.",
    공급자: "(주)에스씨케이컴퍼니",
    이용조건:
      "- 본 상품은 매장 재고 상황에 따라 동일 상품으로 교환이 불가능할 수 있습니다.\n- 동일 상품 교환이 불가한 경우 다른 상품으로 교환이 가능합니다. (차액 발생 시 차액 지불) 만약 다른 상품으로 교환을 원치 않을 경우 매장에서 환불 요청 접수가 가능하며, 환불 요청 접수 시 카카오에서 쿠폰 수신자에게 환불 진행을 위한 알림톡을 발송합니다. - 본 상품은 스타벅스 어플 홈 > Coupon > 모바일 상품권에 추가해 편리하게 사용하실 수 있습니다.\n- 상품 결제 시 본 상품 권면에 기재된 금액의 60% 이상을 결제한 후 남은 잔액은 회원의 계정에 등록된 스타벅스 카드나 보유하고 있는 무기명 스타벅스 카드에 충전됩니다. 스타벅스 카드를 등록 또는 보유하고 있지 않은 고객의 경우, 무기명 스타벅스 카드를 발급받아 잔액을 충전할 수 있습니다. (일부 매장 잔액 적립 불가)\n- 스타벅스 앱의 사이렌 오더를 통해서도 주문 및 결제가 가능합니다. (일부 MD제외)"
  },
  {
    brand: "CU",
    이용가능매장: "전국 CU 매장",
    공급자: "(주)비지에프네트웍스",
    이용조건:
      "- 매장 내 교환 상품이 없을 경우 동일 가격 이상의 다른 상품으로 교환이 가능하며, 추가 금액 결제 후 교환 가능합니다."
  },
  {
    brand: "GS25",
    이용가능매장: "전국 GS25 매장 (일부 특수점포, GS칼텍스, GS SHOP 등 사용 불가)",
    공급자: "GS넷비전",
    이용조건:
      "- 매장 내 교환 상품이 없을 경우 동일 가격 이상의 다른 상품으로 교환 가능하며, 초과 금액은 추가 결제 후 교환 가능합니다.\n- 상품 가격 미만의 금액으로는 결제가 불가합니다.\n- 상품 할인 행사의 경우 교환권 상품 가격 이상의 다른 상품으로 교환 가능합니다.\n- 본 교환권은 현금과 교환되지 않습니다.\n- 매장 내 행사 (1+1, 2+1) 적용 가능합니다. (단, 매장 행사기간 중에만 적용 가능)\n- 현금, 신용카드 등 다른 결제수단과 복합 결제 가능합니다.\n- 매장 교환 시 현금영수증 발급 가능합니다.- 무인점포 및 셀프 계산대에서 사용이 불가합니다.\n- 할인 및 적립은 브랜드사의 정책을 따르고 있으며, 자세한 사항은 GS25에 문의해주십시오.\n- 구매 불가 품목 : 서비스/수탁 상품 (복권, 담배, 교통카드 충전, 택배, 세금&공과금 등) 결제는 불가합니다."
  },
  {
    brand: "배스킨라빈스",
    이용가능매장: "휴게소, 백화점, 공항 등 일부 매장에서는 사용이 제한될 수 있습니다.",
    공급자: "(주)섹타나인",
    이용조건:
      "- 본 상품은 예시 이미지로서 실제 상품과 다를 수 있습니다.\n- 본 상품은 매장 재고 상황에 따라 동일 상품으로 교환이 불가능할 수 있습니다.\n- 동일 상품 교환이 불가한 경우와 기타 사유의 경우 동일 가격 이상의 다른 상품으로 교환이 가능합니다. (차액 발생 시 차액 지불 필요)\n- 본 상품은 해피포인트 어플 하단의 홈 >월렛 > 선물함에서 모바일교환권 등록을 통해 편리하게 사용하실 수 있습니다. 교환권 사용 완료 시 선물함에서 자동 삭제 됩니다.\n※ 단, 2023년 3월 9일 이전 구매한 모바일교환권으로는 단종 또는 품절여부와 관계없이 타제품 교환 가능합니다."
  },
  {
    brand: "설빙",
    이용가능매장:
      "전국 설빙 매장에서 사용 가능합니다. (단, 일부 매장, 백화점/특수매장에서 사용 불가)",
    공급자: "(주)쿠프마케팅",
    이용조건:
      "- 결제 시 모바일 쿠폰을 제시해 주시면 됩니다. (교환 시 각종 적립, 할인은 설빙 본사의 규정에 따릅니다.)\n- 본 상품이 매장 내 재고가 없을 경우 동일 가격의 단일 상품으로 교환 가능하며, 금액이초과되는 단일 상품으로 교환하실 경우 추가 금액 결제 시 교환 가능합니다.\n- 환불, 교환, 승인에 대한문의는 상품권 구매처에 문의해주시기 바랍니다. (설빙은 상품권 구매처가 아니고 사용처입니다.)\n- 본 모바일 쿠폰 및 상품권은 매장 방문 시에만 사용이 가능합니다. (배달주문 시 사용 불가합니다.)\n- 매장별 가격이 상이 할 수 있습니다"
  },
  {
    brand: "맘스터치",
    이용가능매장:
      "- 본 상품은 매장 방문 또는 맘스터치 앱에서 사용 가능하며, 배달앱 주문시에는 사용이 불가합니다.\n - 일부 매장 및 특수매장(휴게소, 특성매장 등)에서는 사용이 불가합니다.\n- 사용불가매장은 홈페이지를 확인바랍니다.",
    공급자: "주식회사 즐거운",
    이용조건:
      "- 이미지는 연출된 것으로 실제와 다를 수 있습니다.\n- 본 상품은 매장 방문 또는 맘스터치 앱에서 교환 가능합니다.\n- 본 상품은 매장 재고 상황에 따라 동일 상품으로 교환이 불가능할 수 있습니다.\n- 동일 상품 교환이 불가능한 경우, 동일 가격 이상의 타 제품으로 교환이 가능하며, 초과금액은 추가 지불하셔야 합니다.\n- 매장별 재고 및 판매 상황에 따라 해당 제품 구매가 불가능한 겨우에는 구매처에 환불을 요청할 수 있습니다.\n- 보유하신 쿠폰의 제품 가격이 인상/인하 되었을 경우, 브랜드사 정책에 따릅니다. (맘스터치 홈페이지 참조) "
  },
  {
    brand: "공차",
    이용가능매장: "본 매장은 모든 매장에서 사용 가능합니다. (단, 일부 매장 제외)",
    공급자: "(주)쿠프마케팅",
    이용조건:
      "- 환불, 교환, 승인에 대한 문의는 공차 본사 및 매장이 아닌 상품권 구매처에 문의해 주시기 바랍니다.\n- 타 상품으로 교환 시 동일 가격 이상의 상품으로 교환 가능하며, 차액은 추가 금액을 지불하셔야 합니다.\n- 본 메뉴 교환권 사용 시 공차 멤버십 스탬프 적립이 가능합니다.\n- 본 상품권 교환 시 각종 할인 및 포인트, 할인 크폰 사용 등은 본사의 규정에 따릅니다.\n- 시즌메뉴 혹은 브랜드 사정에 의해 단종된 메뉴 교환권은 동일 가격 이상의 타 상품으로 매장에서 교환 가능합니다. "
  },
  {
    brand: "투썸플레이스",
    이용가능매장:
      "일부 특수 매장에서 사용 불가하며, 방문하실 매장에 사전 예약 또는 제품 확인 후 방문하시길 바랍니다.",
    공급자: "주식회사 즐거운",
    이용조건:
      "- 일부 제품의 과일 데코레이션은 다른 과일로 대체될 수 있습니다.\n- 본 쿠폰은 해당 상품 또는 동일 가격 이상의 상품으로만 교환 가능하며, 초과금은 추가 결제하여야 합니다.\n- 매장별로 상품 금액이 상이할 수 있으며, 판매가 차액에 따른 초과금 발생 시 추가 결제 후 교환 가능합니다.\n- 단종, 재고 소진 등의 사유로 해당 상품의 교환이 어려워 환불을 원하시는 경우 유효기간 만료 전 선물하기 고객센터로 문의 부탁드립니다.\n- 상품 선택 후 결제 시 모바일 쿠폰을 제시해 주세요./n- 투썸오더(APP) 주문 시 사용 가능합니다.\n- 사용 금액에 대한 현금영수증 발행 가능합니다.\n- 본 쿠폰 사용 시 포인트 적립 및 제휴/할인 혜택과 매장 내 운영하는 세트 메뉴 및 행사 상품의 교환 여부는 교환처의 정책에 따릅니다. "
  }
];

// 공통 조건
const globalConditions = {
  환불조건:
    "① 구매자취소가능(청약철회)기간까지는 구매자가 실결제가의 100%에 대해 주문취소를 요청할 수 있습니다. ② 이후부터 유효기간 만료 전까지는 수신자가 실결제가의 90%에 대해 환불을 요청할 수 있습니다. 나에게 선물하기라면 원결제수단 환불로 우선됩니다. ③ 유효기간 만료부터는 수신자가 선택한 방식에 따라 실결제가의 90%를 환불(또는 원결제취소)받거나 결제금액의 100%를 쇼핑포인트(이벤트포인트)로 적립받을 수 있습니다. 쇼핑포인트 적립은 2023년 9월 1일 이후 판매된 교환권부터 가능합니다. 유효기간 연장 불가 상품은 실결제가의 90% 환불 또는 원결제취소만 가능합니다. 이벤트포인트는 현금으로 인출할 수 없습니다. 이벤트포인트 적립은 보유한도 정책에 따라 한도기준 충족 시 적립받을 수 있습니다. ④ 선물 취소와 환불은 선물함에서 직접 신청할 수 있습니다.",
  전화번호: "1544-2431 (통화료 발생 / 평일 9시 ~ 18시 (※ 점심시간 12:00 ~ 13:00))"
};

export const getNoticeByBrand = (brandName: string) => {
  const brandData = commonNotice.find(brand => brand.brand === brandName);

  if (!brandData) {
    return { error: "정보를 찾을 수 없습니다." };
  }
  if (brandName === "그린스파크") {
    return {
      ...brandData,
      환불조건: "환불 불가 상품입니다",
      전화번호: "1544-2431 (통화료 발생 / 평일 9시 ~ 18시 (※ 점심시간 12:00 ~ 13:00))"
    };
  }
  return {
    ...brandData,
    ...globalConditions
  };
};
